[
  {
    "id": 1,
    "title": "Les champignons de France",
    "content": {
      "text": "Les champignons sont des organismes fongiques qui poussent dans une grande variété d'environnements. En France, il existe de nombreuses espèces de champignons comestibles, telles que les cèpes, les girolles et les morilles. Cependant, il y a aussi des champignons toxiques et mortels, il est donc important de bien connaître les espèces avant de les consommer.",
      "image": "https://example.com/image.jpg"
    },
    "author": "Alice",
    "timestamp": "2023-03-05T12:34:56Z",
    "visibility": "public",
    "username": "alice123",
    "tag": ["cuisine", "information"]
  },
  {
    "id": 2,
    "title": "Recette de risotto aux champignons sauvages",
    "content": {
      "text": "Le risotto aux champignons sauvages est un plat délicieux et facile à préparer. Pour cette recette, vous aurez besoin de champignons sauvages frais, tels que des chanterelles ou des trompettes de la mort, du riz Arborio, du bouillon de légumes, de l'oignon et du parmesan.",
      "image": "https://example.com/image2.jpg"
    },
    "author": "Bob",
    "timestamp": "2023-03-06T01:23:45Z",
    "visibility": "private",
    "username": "bob456",
    "tag": ["cuisine", "information"]
  },
  {
    "id": 3,
    "title": "Les champignons dans l'histoire de la cuisine française",
    "content": {
      "text": "Les champignons ont une longue histoire culinaire en France. Les Romains les considéraient comme un mets de choix, tandis que les rois de France les appréciaient particulièrement. Aujourd'hui, les champignons sont toujours très populaires dans la cuisine française, en particulier dans les plats traditionnels tels que la soupe à l'oignon gratinée et le coq au vin.",
      "image": null
    },
    "author": "Charlie",
    "timestamp": "2023-03-07T09:08:07Z",
    "visibility": "public",
    "username": "charlie789",
    "tag": ["cuisine", "information"]
  },
  {
    "id": 4,
    "title": "Les cèpes de France",
    "content": {
      "text": "Les cèpes sont l'une des espèces de champignons les plus appréciées en France. Leur chair ferme et leur goût prononcé les rendent délicieux dans de nombreux plats, comme les omelettes, les risottos et les soupes. Mais attention, il est important de bien les identifier car il existe des espèces toxiques similaires.",
      "image": "https://example.com/image1.jpg"
    },
    "author": "Sophie",
    "timestamp": "2023-03-08T15:30:00Z",
    "visibility": "public",
    "username": "sophie456",
    "tag": ["cuisine", "information"]
  },
  {
    "id": 5,
    "title": "Comment cuisiner les champignons sauvages",
    "content": {
      "text": "Les champignons sauvages, tels que les chanterelles et les trompettes de la mort, sont délicieux et aromatiques. Avant de les cuisiner, il est important de bien les nettoyer pour enlever la saleté et les petites bêtes. Ensuite, vous pouvez les faire revenir dans de l'huile ou du beurre, ou les utiliser dans des sauces ou des soupes.",
      "image": "https://example.com/image2.jpg"
    },
    "author": "Luc",
    "timestamp": "2023-03-09T10:45:00Z",
    "visibility": "public",
    "username": "luc789",
    "tag": ["cuisine", "information"]
  }
]
