[

    {
        "id": 1,
        "name": "Grilled Portobello Mushrooms Stacked with Fresh Spinach and Shaved Manchego Cheese",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/bobby-flay\/grilled-portobello-mushrooms-stacked-with-fresh-spinach-and-shaved-manchego-cheese-recipe\/index.html",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "May want to only do 8 if mushroom caps are large.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Heat grill to high. Brush mushroom caps on both sides with oil and season with salt and pepper. Grill, cap side down, until slightly charred, about 4 to 5 minutes. Turn the mushrooms over and continue grilling until just cooked through, about 3 to 4 minutes longer.\r\n\r\nStack the ingredients on each of 4 salad plates starting with a mushroom cap, a slice of cheese, some spinach, and a drizzle of Sherry Vinaigrette. Add another mushroom cap, more vinaigrette, spinach, and another slice of cheese. Place a third mushroom cap on top and finish by drizzling with additional vinaigrette and garnishing with chopped chives, if desired.\r\n\r\nSherry Vinaigrette",
        "ingredients": [
            "4 ounce manchego cheese, thinly sliced into 8 pieces\r",
            "3 cup baby spinach, washed and dried\r",
            "1 teaspoon freshly ground black pepper\r",
            "1 teaspoon kosher salt\r",
            "2 tablespoon olive oil\r",
            "12 portobello mushroom caps, wiped clean\r",
            "2 tablespoon fresh chives, finely chopped, for garnish, optional\r",
            "1 serving Sherry Vinaigrette"
        ],
        "tags": [
            "vegetarian",
            "main",
            "mushrooms",
            "cheese"
        ]
    },

    {
        "id": 2,
        "name": "Sherry Vinaigrette",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/bobby-flay\/grilled-portobello-mushrooms-stacked-with-fresh-spinach-and-shaved-manchego-cheese-recipe\/index.html",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Whisk together the shallot, vinegar, mustard, salt, and pepper in a small bowl. Slowly whisk in the oil until emulsified.",
        "ingredients": [
            "1 small shallot, finely chopped\r",
            "1\/4 cup sherry vinegar or balsamic vinegar\r",
            "2 teaspoon Dijon mustard\r",
            "1\/4 teaspoon kosher salt\r",
            "1\/4 teaspoon freshly ground black pepper\r",
            "1\/2 cup olive oil"
        ],
        "tags": [
            "dressing",
            "components"
        ]
    },
   
    {
        "id":3,
        "name": "Wild Mushroom Risotto",
        "source": "Bride and Groom First and Forever Cookbook by Barber and Whiteford",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 2700,
        "servings": 2,
        "comments": "",
        "calories": 1508,
        "fat": 70,
        "satfat": 20,
        "carbs": 166,
        "fiber": 8,
        "sugar": 20,
        "protein": 48,
        "instructions": "Heat the olive oil in a large pot over medium-high heat. Add the onion and saute, stirring frequently with a wooden spoon for 2 minutes. Add the mushrooms and cook until tender and slightly brown, about 8 minutes (add a splash more oil if necessary). Add the garlic and cook for 2 minutes more. \r\n\r\nAdd the rice and stir well, about 30 seconds. Add the wine and simmer, stirring constantly until the liquid is absorbed, 2 to 3 minutes. Add the stock, reduce the heat to medium, and cook, stirring occasionally, until the stock is absorbed, the rice is just tender, and the risotto is creamy. The total cooking time is 20 to 25 minutes.\r\n\r\nStir in 1\/4 cup cheese, the thyme, and butter. If the rice appears dry, add up to 1\/4 cup water to loosen the risotto slightly. Season with salt and pepper to taste.\r\n\r\nDivide the risotto between 2 large bowls and drizzle with truffle oil, if desired. Sprinkle with the remaining cheese and the chives.",
        "ingredients": [
            "2 1\/2 tablespoon olive oil\r",
            "1 small yellow onion, diced\r",
            "8 oz shiitake or cremini mushrooms, cleaned and sliced (if using shiitakes, discard stems)\r",
            "1 tbsp garlic, roughly chopped\r",
            "3\/4 cup arborio rice\r",
            "1\/2 cup dry white wine\r",
            "3 1\/2 cup vegetable stock (or chicken stock)\r",
            "3\/8 cup Parmesan cheese, grated, divided use\r",
            "1\/2 tsp thyme\r",
            "1 tbsp unsalted butter\r",
            "Salt and freshly ground pepper\r",
            "Truffle oil, for drizzling, optional\r",
            "1 tbsp parsley, chopped"
        ],
        "tags": [
            "main",
            "risotto",
            "mushrooms",
            "vegetarian"
        ]
    },
    {
        "id":4,
        "name": "Spinach lasagna with mushroom ragu",
        "source": "Food Network Magazine Nov 2011",
        "preptime": 1800,
        "waittime": 900,
        "cooktime": 10920,
        "servings": 8,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Make the ragu: Soak the porcini mushrooms in 1 cup hot water until soft, about 15 minutes. Strain through a fine-mesh sieve over a bowl. Chop; reserve the liquid.\r\n\r\n2. Meanwhile, heat the olive oil in a pot over medium heat. Add the onion, carrot and celery and cook until soft, 5 minutes. Stir in the garlic and tomato paste and cook, stirring, 2 more minutes. Add the portobello and shiitake mushrooms, 1 teaspoon salt and 1\/2 teaspoon pepper; cook, stirring until the mushrooms are soft, 5 more minutes.\r\n\r\n3. Add the porcini mushrooms, cook 2 minutes. Add the reserved porcini liquid, bring to a boil and cook until reduced slightly, about 3 minutes. Add the tomatoes and their juice, 2 cups water and the bay leaves; bring to a boil, stirring occasionally. Reduce the heat to medium low, add the parsley and 1 teaspoon salt and simmer, stirring a few times, until thick, about 1 hour, 30 minutes. Discard the bay leaves. (you can make the ragu up to 1 day ahead; let cool, then cover and chill. Reheat before using.)\r\n\r\n4. Make the lasagna filling: Mix the parmesan, mozzarella and asiago; set 1 1\/2 cups of the cheese mixture aside. Combine the remaining cheese mixture in a large bowl with the ricotta, eggs, spinach, nutmeg and 1\/2 teaspoon salt.\r\n\r\n5. Preheat the oven to 375F. Bring a pot of water to a boil and add a generous amount of salt. Add the noodles and cook as the label directs. Drain and rinse under cold water; shake off the excess water.\r\n\r\n6. Spread 1 cup of the ragu in a 9-by-13-inch baking dish. Add a layer of noodles, then half of the spinach mixture and 2 cups ragu. Repeat with another layer of noodles, spinach mixture and ragu. Top with the remaining noodles and ragu and sprinkle with the reserved cheese. Cover with foil, place on a baking sheet and bake 50 minutes. Uncover and bake until golden, about 25 more minutes. Let rest before serving.",
        "ingredients": [
            "1 oz dried porcini mushrooms\r",
            "2 tbsp extra-virgin olive oil\r",
            "1 medium onion, chopped\r",
            "1 large carrot, finely chopped\r",
            "1 stalk celery, finely chopped\r",
            "4 clove garlic, chopped\r",
            "2 tbsp tomato paste\r",
            "2 portobello mushroom cap, chopped\r",
            "1 1\/2 lb shiitake mushrooms, stems removed, chopped\r",
            "Kosher salt and freshly ground pepper\r",
            "2 28oz cans whole San Marzano tomatoes, crushed by hand\r",
            "3 bay leaves\r",
            "1\/4 cup fresh parsley, chopped\r",
            "<hr>\r",
            "3 oz parmesan cheese, grated\r",
            "1 1\/2 lb part-skim mozzarella cheese, shredded\r",
            "8 oz asiago cheese, shredded\r",
            "2 lb ricotta cheese\r",
            "2 large eggs, lightly beaten\r",
            "1 lb frozen chopped spinach, thawed and squeezed dry\r",
            "1\/4 tsp nutmeg, freshly grated\r",
            "12 oz dried lasagna noodles"
        ],
        "tags": [
            "italian",
            "vegetarian",
            "main"
        ]
    },
    {
        "id": 5,
        "name": "Hearty spinach and chickpea soup",
        "source": "http:\/\/www.marthastewart.com\/359776\/hearty-spinach-and-chickpea-soup?center=0&gallery=274637&slide=283080",
        "preptime": 2700,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Cook rice if not already done.\r\n\r\nMeanwhile, in a large saucepan or Dutch oven, heat oil over medium heat. Add onion and cook, stirring frequently, until tender, about 5 minutes. Add garlic and mushrooms and cook, stirring occasionally, until mushrooms are tender, about 5 minutes. Add broth and rosemary; bring to a boil.\r\n\r\nStir cooked rice and chickpeas into the broth; return to a boil. Reduce to a simmer, cover, and continue cooking for 5 more minutes to allow flavors to blend.\r\n\r\nStir in spinach and cook, uncovered, until just wilted, about 1 minute. Season with salt and pepper. Garnish with cheese; serve immediately.",
        "ingredients": [
            "2 cup cooked brown rice\r",
            "1 tablespoon olive oil\r",
            "1 medium onion, finely chopped\r",
            "2 clove garlic, minced\r",
            "8 ounce fresh shiitake mushrooms, stems removed, caps thinly sliced\r",
            "6 cup reduced-sodium chicken or vegetable broth\r",
            "1\/2 teaspoon dried rosemary, crumbled\r",
            "1 can chickpeas, drained and rinsed\r",
            "10 oz baby spinach leaves\r",
            "Coarse salt and ground pepper, to taste\r",
            "1\/2 cup grated Parmesan cheese"
        ],
        "tags": [
            "soup",
            "main",
            "untried"
        ]
    },
    {
        "id": 6,
        "name": "Mushroom soup",
        "source": "http:\/\/www.marthastewart.com\/351301\/mushroom-soup?center=0&gallery=274637&slide=285828",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 12,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Cover dried mushrooms with 2 cups boiling water in a heatproof bowl; let stand until soft, about 30 minutes. Using a slotted spoon, transfer mushrooms to a cutting board, and finely chop; set aside. Strain soaking liquid; set aside.\r\n\r\nMelt butter in a large saucepan over medium heat. Add leeks; cook, stirring occasionally, until soft but not browned, 10 to 15 minutes. Stir in flour; cook 2 minutes. Add sherry; whisk until smooth. Whisk in stock, thyme, and reserved soaking liquid; bring to a boil. Reduce heat; simmer 5 minutes. Stir in dried and fresh mushrooms. Remove from heat.\r\n\r\nPour into a large bowl. Working in 3 batches, puree soup in a food processor, making sure there are no remaining mushroom pieces; return to pan. Bring to a simmer; cook, stirring occasionally, 15 minutes. Season with salt and pepper.\r\n\r\nStir in cream; bring just to a simmer. Season with salt. Stir in milk; cook until just heated through. Serve immediately, or refrigerate, covered, up to 3 days; reheat before serving. To serve, divide among bowls; spoon about 2 teaspoons chervil cream into each center, and sprinkle with croutons.",
        "ingredients": [
            "3\/4 cup dried Polish or porcini mushrooms (about 3\/4 ounce)\r",
            "6 tablespoon unsalted butter\r",
            "3 medium leeks (about 1 pound), white and pale-green parts only, finely chopped and rinsed well\r",
            "6 tablespoon all-purpose flour\r",
            "3\/4 cup medium sherry, such as amontillado\r",
            "5 cup homemade or low-sodium store-bought chicken stock\r",
            "1\/2 teaspoon finely chopped fresh thyme\r",
            "2 pound cremini mushrooms\r",
            "Coarse salt and freshly ground pepper\r",
            "1 cup heavy cream\r",
            "1 cup whole milk\r",
            "2 servings Chervil Cream",
            "homemade croutons, for serving"
        ],
        "tags": [
            "mushroom",
            "main",
            "soup",
            "untried"
        ]
    },
    {
        "id": 7,
        "name": "Mushroom and lentil soup",
        "source": "Everyday Food Nov 2011",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 1656,
        "fat": 33,
        "satfat": 4,
        "carbs": 233,
        "fiber": 45,
        "sugar": 28,
        "protein": 106,
        "instructions": "In a large Dutch oven or other heavy pot, heat oil over medium. Add carrots, onion, and garlic and cook, stirring occasionally, until beginning to soften, about 6 minutes. Add mushrooms and season with salt and pepper. Cook until mushrooms are softened and golden brown at edges, about 8 minutes.\r\n\r\nAdd thyme, lentils, soy sauce, lemon, and water; bring to a boil. Reduce heat, partially cover, and simmer until lentils are tender, about 25 minutes. Season to taste with salt and pepper. Serve soup topped with yogurt.\r\n\r\nAlternate recipe: use half rice and half lentils.  Add the rice with the water; cook for 15 minutes on medium, before boiling.  Then add lentils, bring to a boil, and simmer for 25 minutes.",
        "ingredients": [
            "2 tablespoon extra-virgin olive oil\r",
            "5 small carrots, diced small\r",
            "1 medium red onion, diced small\r",
            "4 clove garlic, minced\r",
            "3\/4 pound cremini mushrooms, trimmed and coarsely chopped (4 cups)\r",
            "Coarse salt and ground pepper\r",
            "9 sprig thyme\r",
            "3\/4 pound brown lentils\r",
            "7 cup water\r",
            "2 tablespoon soy sauce\r",
            "1\/4 lemon, juiced\r",
            "2\/3 cup nonfat plain Greek yogurt, for serving"
        ],
        "tags": [
            "soup",
            "lentils",
            "vegetarian",
            "main"
        ]
    },
    {
        "id": 8,
        "name": "Veggie Pizza",
        "source": "",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 450°.\r\n\r\nMix oil and garlic together in small bowl.  Brush onto pizza crust, then bake for 5 minutes, or until garlic is fragrant.\r\n\r\nMix together cheese and italian seasoning.  Sprinkle on crust.  Top with veggies, then finish with parmesan.  Bake for an additional 7-10 minutes, until cheese is melted.",
        "ingredients": [
            "1 pizza crust\r",
            "1 1\/2 cup mozzarella (low-moisture)\r",
            "2 tsp Italian seasoning\r",
            "1\/4 white onion, sliced\r",
            "2 large cremini mushrooms\r",
            "1\/2 tomato, sliced\r",
            "1\/2 zucchini, sliced\r",
            "1\/4 cup parmesan, grated\r",
            "2 clove garlic\r",
            "2 tbsp olive oil"
        ],
        "tags": [
            "vegetarian",
            "pizza",
            "main"
        ]
    },
    {
        "id": 9,
        "name": "Tomato, Basil and Portobello Napoleons",
        "source": "http:\/\/new.pamperedchef.com\/recipe\/72973",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 1500,
        "servings": 4,
        "comments": "",
        "calories": 1136,
        "fat": 68,
        "satfat": 24,
        "carbs": 76,
        "fiber": 16,
        "sugar": 16,
        "protein": 44,
        "instructions": "Preheat oven to 450°F (230°C). \r\n\r\nMake the dressing: whisk vinegar, oil, garlic, seasoning, and salt together. Baste mushrooms on both sides, then place mushrooms gills-down and bake for 10 min. Flip, top with tomato slices, and bake for another 10 min.\r\n\r\nMeanwhile, toast the nuts, and pan-toast the breadcrumbs (with olive oil, salt, and italian seasoning) to desired darkness.\r\n\r\nPlate the mushrooms when finished, then top with goat cheese, basil, nuts, and bread crumbs. Drizzle with olive oil if desired.",
        "ingredients": [
            "2 tbsp white wine vinegar\r",
            "2 garlic clove, pressed\r",
            "1\/4 tsp Italian Seasoning\r",
            "1\/4 tsp salt\r",
            "2 tbsp olive oil\r",
            "8 large portobello mushroom caps, stem removed\r",
            "<hr>\r",
            "4 large tomatoes, cut into 2 thick slices each\r",
            "4 oz log goat cheese\r",
            "1\/3 cup pine nuts, toasted and chopped\r",
            "1\/2 cup fresh bread crumbs, toasted\r",
            "1\/2 tsp Italian Seasoning\r",
            "1 tbsp olive oil\r",
            "4 large basil leaves, thinly sliced"
        ],
        "tags": [
            "salad",
            "vegetarian"
        ]
    },
    {
        "id": 10,
        "name": "Baked Penne with Roasted Vegetables",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/giada-de-laurentiis\/baked-penne-with-roasted-vegetables-recipe\/index.html",
        "preptime": 1500,
        "waittime": 0,
        "cooktime": 2400,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 450 degrees F.\r\n\r\nOn a baking sheet, toss the peppers, zucchini, squash, mushrooms, and onions with olive oil, salt, pepper, and dried herbs. Roast until tender, about 15 minutes.\r\n\r\nMeanwhile, bring a large pot of salted water to a boil over high heat. Add the pasta and cook for about 6 minutes. Since you will be cooking the pasta a second time in the oven, you want to make sure the inside is still hard. Drain in a colander.\r\n\r\nIn a large bowl, toss the drained pasta with the roasted vegetables, marinara sauce, cheeses, peas, salt, and pepper. Using a wooden spoon, gently mix, until all the pasta is coated with the sauce and the ingredients are combined.\r\n\r\nPour the pasta into a greased 9 by 13-inch pan. Top with the remaining 1\/3 cup Parmesan and butter pieces. Bake until top is golden and cheese melts, about 25 minutes.",
        "ingredients": [
            "2 red bell peppers, cored and cut into 1-inch wide strips\r",
            "2 zucchini, quartered lengthwise and cut into 1-inch cubes\r",
            "2 yellow squash, quartered lengthwise and cut into 1-inch cubes\r",
            "4 cremini mushrooms, halved\r",
            "1 yellow onion, peeled and sliced into 1-inch strips\r",
            "1\/4 cup extra-virgin olive oil\r",
            "1\/2 teaspoon salt\r",
            "1\/2 teaspoon freshly ground black pepper\r",
            "1 tablespoon dried Italian herb mix, or herbs de Provence\r",
            "<hr>",
            "1 pound penne pasta\r",
            "3 cup marinara sauce, (store bought or homemade)\r",
            "1 cup fontina cheese, grated\r",
            "1\/2 cup smoked mozzarella, grated\r",
            "1\/2 teaspoon salt\r",
            "1\/2 teaspoon freshly ground black pepper\r",
            "1 1\/2 cup frozen peas, thawed\r",
            "1\/4 cup Parmesan, grated\r",
            "<hr>",
            "1\/3 cup Parmesan, for topping\r",
            "2 tablespoon butter, cut into small pieces"
        ],
        "tags": [
            "vegetarian",
            "pasta",
            "main",
            "untried"
        ]
    },
    {
        "id": 11,
        "name": "Pesto millet grits with tomato ragout",
        "source": "Pampered Chef",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 1800,
        "servings": 6,
        "comments": "Adapted from Pesto polenta squares with tomato ragout",
        "calories": 3204,
        "fat": 80,
        "satfat": 22,
        "carbs": 486,
        "fiber": 136,
        "sugar": 62,
        "protein": 182,
        "instructions": "Adapted recipe to use grits. May not be entirely correct on cooking times!\r\n\r\n1. Preheat oven to 350F. For pesto, press garlic into bowl of food processor. Add basil, black pepper, and salt. Process until basil is coarsely chopped. Slowly add oil and process until incorporated. Set aside.\r\n\r\n2. For grits, follow package instructions substituting milk for water. Mix in pesto when done cooking. Remove from heat and set aside.\r\n\r\n3. Meanwhile for ragout, heat oil over medium heat in 11 or 12 inch skillet. Add mushrooms and shallots. Cook and stir for 3 minutes or until mushrooms start to brown. Add garlic and cook an additional 1 minute or until fragrant. Move mushroom mixture to side of skillet. Add tomatoes; cook, covered, 4-5 minutes or until tomato skins start to split. Carefully break up tomatoes and mix with mushrooms. Reduce heat to medium-low add remaining ragout ingredients, except cheese and basil. Cook 4-5 minutes or until heated through.\r\n\r\n4. Serve grits in bowl, top with ragout and sprinkle with cheese and basil.",
        "ingredients": [
            "2 clove garlic\r",
            "2 cup fresh basil, lightly packed\r",
            "2 tbsp olive oil\r",
            "1\/2 tsp black pepper\r",
            "1\/2 tsp salt\r",
            "3 cup milk\r",
            "1 cup uncooked millet grits\r",
            "<hr>\r",
            "1 tbsp olive oil\r",
            "8 oz white button mushrooms, sliced\r",
            "1 large shallot, finely chopped\r",
            "2 clove garlic, pressed\r",
            "2 10oz containers grape tomatoes\r",
            "1 15oz can cannellini beans, drained and rinsed\r",
            "1 tbsp capers, drained\r",
            "1 tbsp balsamic vinegar\r",
            "1\/2 tsp crushed red pepper flakes\r",
            "<hr>\r",
            "2 oz mozzarella, grated or shredded\r",
            "3 tbsp fresh basil leaves, thinly sliced"
        ],
        "tags": [
            "vegetarian",
            "main",
            "untried"
        ]
    },
    {
        "id": 12,
        "name": "Spicy orange tofu and vegetable stir-fry",
        "source": "Pampered Chef",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 900,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. For sauce, combine orange juice, hot sauce, soy sauce and starch in prep bowl; whisk until smooth and set aside.\r\n\r\n2. Combine ginger and pressed garlic in another prep bowl, set aside.\r\n\r\n3. Heat oil in 11 or 12 inch skillet over medium-high heat. Place flour in shallow dish. Add half of the tofu and toss gently to coat. Repeat with remaining tofu. Add tofu to skillet; cook 8-10 minutes or until browned on all sides, turning often. Remove tofu from skillet to plate.\r\n\r\n4. Add mushrooms, bell pepper, green onions, pea pods and ginger mixture to skillet. Cook 3-4 minutes, stirring occasionally, until vegetables are crisp tender. Whisk sauce mixture and add to skillet; cook 30-60 seconds or until sauce is thickened. Return tofu to skillet; stir gently. Serve sprinkled with peanuts.",
        "ingredients": [
            "1 cup fresh orange juice\r",
            "4 tsp Sriracha\r",
            "2 tbsp soy sauce\r",
            "1 1\/2 tsp arrowroot starch\r",
            "<hr>\r",
            "1 tbsp ginger, grated\r",
            "3 garlic cloves, pressed\r",
            "14 oz extra-firm tofu, drained and patted dry, cut into 3\/4 inch cubes\r",
            "1 tbsp olive oil\r",
            "3 tbsp whole wheat flour\r",
            "5 oz shiitake mushrooms, stems removed, thinly sliced\r",
            "1 medium red bell pepper, cut into 3\/4 inch pieces\r",
            "6 green onions, cut into 1 inch pieces\r",
            "1 cup pea pods, trimmed\r",
            "1\/4 cup dry roasted peanuts, coarsely chopped"
        ],
        "tags": [
            "vegetarian",
            "main"
        ]
    },
    {
        "id": 13,
        "name": "Rosemary mushroom chickpea ragout",
        "source": "http:\/\/www.thefirstmess.com\/2013\/11\/27\/vegan-rosemary-mushroom-chickpea-ragout-on-toast-recipe\/",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "use vegetarian worchestershire and non-dairy milk if needing to make this strictly vegetarian\/vegan.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Heat the olive oil in a large sautè or sauce pan over medium heat. Add the shallots and stir. Once those are a bit fragrant, add the rosemary. Sauté until the shallots are really translucent. Add the mushrooms to the pan and stir them around. Add the sherry vinegar, tomato paste, worcestershire sauce, and chickpeas and stir. Once the mushrooms have started softening just a bit, about 3 minutes, add the stock. Stir everything up and simmer until the liquid has reduced by a third and the mushrooms are quite soft. Add the splash of milk and stir. Season the whole thing to taste. In a small bowl, combine the starch with a little bit of the liquid from the pot. Make a little slurry and then add it back in to the pot. Simmer until lightly thickened. Keep warm.\r\n\r\nToast or grill the pieces of toast. Lay them in shallow bowls. Ladle the mushroom and chickpea ragoût on top. Finish with a bit more black pepper. Serve hot.",
        "ingredients": [
            "1 tbsp olive oil\r",
            "1 shallot, fine dice\r",
            "1 sprig rosemary, leaves chopped fine\r",
            "10 ounce shiitake mushrooms, stems removed + caps sliced\r",
            "1 splash of sherry vinegar\r",
            "1 tsp tomato paste\r",
            "2 tsp worcestershire sauce\r",
            "1 cup chickpeas, cooked\r",
            "1 cup vegetable stock\r",
            "1 tbsp milk\r",
            "1 tsp potato starch\r",
            "salt\r",
            "pepper\r",
            "2 thick slices bread"
        ],
        "tags": [
            "main",
            "untried",
            "vegetarian"
        ]
    },
    {
        "id": 14,
        "name": "Sauteed Mushrooms with Toasted Flatbread and Baked Eggs",
        "source": "http:\/\/www.marthastewart.com\/1043842\/sauteed-mushrooms-toasted-flatbread-and-baked-eggs",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 900,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Preheat oven to 425 degrees. Toast flatbread over the flame of a gas burner or under broiler. Tear into 2-inch pieces; set aside.\r\n\r\n2. Heat oil and garlic in a large ovenproof skillet over medium heat, stirring, until garlic is fragrant but not browned, about 1 minute. Increase heat to medium-high, add mushrooms, and cook, stirring occasionally, until tender and golden brown, about 10 minutes. Season with salt and red-pepper flakes. Add wine, scraping up browned bits. Stir in flatbread and thyme; remove from heat.\r\n\r\n3. Make 4 shallow wells in mushroom mixture and crack 1 egg into each well. Transfer to oven and cook until egg whites have just set, about 4 minutes. Season eggs with salt and red-pepper flakes.",
        "ingredients": [
            "1 6-inch whole-wheat flatbread, such as naan or pocketless pita\r",
            "3 tablespoon extra-virgin olive oil\r",
            "2 clove garlic, sliced\r",
            "1 pound mixed mushrooms, such as cremini, shiitake, and oyster, trimmed and sliced 1\/8-inch thick (about 10 cups)\r",
            "Coarse salt\r",
            "Red-pepper flakes\r",
            "1\/4 cup dry white wine\r",
            "2 tablespoon fresh thyme\r",
            "4 eggs, room temperature"
        ],
        "tags": [
            "vegetarian",
            "main",
            "untried"
        ]
    },
    {
        "id": 15,
        "name": "Farmer's market vegetable pot pie",
        "source": "The Vegetarian Table by Pampered Chef",
        "preptime": 2700,
        "waittime": 0,
        "cooktime": 900,
        "servings": 4,
        "comments": "",
        "calories": 1920,
        "fat": 90,
        "satfat": 42,
        "carbs": 234,
        "fiber": 36,
        "sugar": 0,
        "protein": 60,
        "instructions": "Preheat oven to 400F. If necessary, thaw pie crust.\r\n\r\nHeat oil in 12-inch skillet over medium high heat 1-3 minutes or until shimmering. Add potatoes and onion; cook and stir 1 minute. Reduce heat to medium-low. Add carrots; cook, covered 5 minutes, stirring occasionally. Add mushrooms and cauliflower; cook, covered 5-7 minutes or until potatoes are tender, stirring ocasionally. Stir in asparagus, peas, salt and pepper; remove skillet from heat.\r\n\r\nMeanwhile, combine 1\/3 of the milk and flour in a small bowl; whisk until smooth. In 3-qt saucepan, bring remaining milk to a simmer over medium-low heat. Add boursin to saucepan; whisk well. Gradually add flour mixture; whisk until smooth. Bring to a simmer; cook 1 minute, whisking constantly. Add cheese sauce and parsley to skillet, mix gently.\r\n\r\nPour filling into a deep dish pie plate, and top with pie crust. (Or pour into a pie crust that's been pre-baked for 10-12 minutes.) Bake 12-15 minutes or until golden brown and filling starts to bubble. Let stand 5 minutes before serving. ",
        "ingredients": [
            "1 tsp olive oil\r",
            "1\/2 lb Yukon gold potatoes, unpeeled, diced into 1\/4 inch pieces\r",
            "1\/2 medium onion, finely chopped\r",
            "1 1\/2 medium carrots, peeled, diced into 1\/4 inch pieces\r",
            "4 oz cremini mushrooms, cut into quarters\r",
            "1\/2 cup cauliflower, cut into small florets\r",
            "2 oz asparagus, trimmed and cut into 1 inch pieces\r",
            "1\/2 cup frozen peas\r",
            "1\/2 tsp salt\r",
            "1\/4 tsp black pepper, coarsely ground\r",
            "<hr>\r",
            "1\/8 cup fresh parsley, finely chopped\r",
            "3\/4 cup milk, divided\r",
            "1 tbsp all-purpose flour\r",
            "2 1\/2 oz Boursin cheese\r",
            "<hr>\r",
            "1 pie crust"
        ],
        "tags": [
            "vegetarian",
            "main"
        ]
    },
    {
        "id": 16,
        "name": "Poblano, mushroom and potato tacos",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/food-network-kitchens\/poblano-mushroom-and-potato-tacos-recipe.html",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 2100,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Roast the poblanos directly over the flame of a gas burner or under the broiler, turning with tongs, until charred all over, about 10 minutes. Transfer to a bowl, cover with a plate and let steam until cool enough to handle, about 10 minutes. Scrape off the charred skin with a paring knife; remove the stems and seeds. Cut the poblanos into strips and set aside.\r\nMeanwhile, put the potatoes in a large nonstick skillet and cover with cold water; season with salt. Bring to a simmer over medium-high heat and cook until just tender, 5 to 6 minutes; drain. Wipe the skillet dry.\r\n\r\nHeat the olive oil in the skillet over medium-high heat. Add the potatoes and cook until golden and crisp, about 4 minutes per side. Remove with a slotted spoon and drain on paper towels. While still hot, sprinkle with half of the herbs, and salt to taste. Discard the excess oil and wipe out the skillet.\r\n\r\nHeat the butter in the skillet over medium-high heat. Add the onion and cook, stirring occasionally, until golden, about 6 minutes. Add the mushrooms and cook, stirring occasionally, until golden, 6 to 8 minutes. Stir in the remaining herbs and the garlic; cook 1 minute. Add the roasted poblanos, crema, lime juice and a few spoonfuls of water; stir until warmed through, 1 to 2 minutes. Season with salt and pepper. Serve the potatoes and mushroom mixture in tortillas with assorted toppings.\r\n\r\n\r\n",
        "ingredients": [
            "4 medium poblano chile peppers\r",
            "3 medium Yukon gold potatoes, peeled and cut into 1\/2-inch pieces\r",
            "Kosher salt\r",
            "2 tablespoon extra-virgin olive oil\r",
            "1 1\/2 tablespoon fresh cilantro, finely chopped \r",
            "1 1\/2 tablespoon fresh parsley, finely chopped \r",
            "2 tablespoon unsalted butter\r",
            "1 large onion, halved and thinly sliced\r",
            "12 ounce cremini mushrooms, trimmed and thinly sliced\r",
            "1 clove garlic, minced\r",
            "1\/2 cup creme fraiche (or Mexican crema)\r",
            "2 limes, juiced\r",
            "Freshly ground pepper\r",
            "12 small flour tortillas, warmed\r",
            "1\/2 cup Queso fresco, crumbled"
        ],
        "tags": [
            "vegetarian",
            "main",
            "tacos",
            "untried"
        ]
    },
    {
        "id": 17,
        "name": "Wild mushroom and cauliflower lasagna",
        "source": "http:\/\/www.foodnetwork.com\/recipes\/bobby-flay\/wild-mushroom-and-cauliflower-lasagna-recipe.html",
        "preptime": 3000,
        "waittime": 2700,
        "cooktime": 8100,
        "servings": 8,
        "comments": "",
        "calories": 7792,
        "fat": 448,
        "satfat": 224,
        "carbs": 576,
        "fiber": 72,
        "sugar": 136,
        "protein": 368,
        "instructions": "For the tomato sauce: Heat the oil in a medium saucepan over medium-high heat. Add the onions and cook until soft. Add the garlic and red pepper flakes and cook for 30 seconds. Add the tomatoes, breaking them up with a wooden spoon, and the basil and cook until thickened and the tomatoes soften and break down. season with salt and pepper.\r\n\r\nTransfer to a blender and blend until smooth. Return the mixture to the saucepan, add the basil and chopped parsley, season with salt, pepper, and honey, if needed.\r\n\r\nFor the cauliflower sauce: Preheat the oven to 350 degrees F. Remove the florets from the head of cauliflower and put in a small roasting pan. Drizzle with olive oil and season with salt and pepper. Add 1 1\/2 cups water to the bottom of the pan, cover with foil, and cook until very tender, about 1 hour. Remove and increase the oven temperature to 375 degrees F.\r\n\r\nMelt the butter in a medium saucepan over medium heat. Whisk in the flour and cook for 30 seconds. Slowly whisk in 4 cups of the milk, increase the heat and bring to a boil, whisking constantly. Cook until thickened, about 5 minutes. Add the cauliflower, reduce the heat to low, and cook for 5 minutes longer. Remove from the heat and let cool slightly. Transfer the mixture to a blender (in batches) and puree until smooth. Strain the mixture into a clean saucepan through a medium mesh strainer and bring to a simmer over low heat. Whisk in the nutmeg, cheese, and salt and pepper, to taste. Cook for 1 minute. Add some of the remaining warm milk, if needed.\r\n\r\nFor the lasagna: Increase the oven to 375 degrees F. Combine the ricotta, egg, 1\/2 cup parsley, 1 teaspoon thyme, and romano cheese in a bowl and season with salt and pepper. Cover and refrigerate until ready to use.\r\n\r\nHeat the olive oil in a large saute pan over high heat. Add the garlic cloves and cook for 1 minute. Add the mushrooms and cook until they begin to soften. Add the shallots and cook until golden brown and completely dry. Drain the porcini mushrooms, reserving the soaking liquid, coarsely chop, and add to the mushrooms in the pan and cook for 1 minute. Deglaze with the porcini soaking liquid and cook until completely reduced. Stir in the remaining 2 teaspoons thyme, remaining 1\/4 cup parsley, and season with salt and pepper. Remove from the heat.\r\n\r\nTo assemble: Ladle some of the tomato sauce into the bottom of a 10 by 14 by 2 1\/2-inch baking dish. Ladle some of the cauliflower mornay sauce over the tomato sauce. Top with 4 noodles. Top the noodles with some of the ricotta mixture, then some mushrooms, fontina, and romano. Season with salt and pepper. Repeat to make 4 layers. Ladle the cauliflower mornay sauce over the top of the noodles, making sure to cover the noodles completely with the sauce, and sprinkle with more of the romano cheese. Put the lasagna pan on a baking sheet, cover with foil, and bake for 30 minutes. Remove the foil and continue baking until bubbly and the top is golden brown, 30 to 40 minutes longer. Remove from the oven, sprinkle the top with parsley, and let rest 15 minutes before serving. Cut into squares and serve additional tomato sauce on the side.\r\n\r\nRecipe courtesy of Bobby Flay\r\n\r\n",
        "ingredients": [
            "2 tablespoon olive oil\r",
            "1 small yellow onion, finely diced\r",
            "2 clove garlic, finely chopped\r",
            "Pinch red pepper flakes\r",
            "3 cup canned plum tomatoes, and their juices\r",
            "2 tablespoon fresh basil, chopped\r",
            "3 tablespoon fresh flat-leaf parsley, chopped\r",
            "Salt and freshly ground black pepper\r",
            "Honey\r",
            "<hr>\r",
            "1 medium head cauliflower\r",
            "2 tablespoon olive oil\r",
            "Salt and freshly ground black pepper\r",
            "4 tablespoon unsalted butter\r",
            "1\/4 cup flour\r",
            "5 cup whole milk, heated, divided\r",
            "1\/8 teaspoon freshly grated nutmeg\r",
            "1\/2 cup romano cheese, grated\r",
            "<hr>\r",
            "1 pound part-skim ricotta cheese\r",
            "1 large egg\r",
            "3\/4 cup fresh flat-leaf parsley, finely chopped, divided, plus more for garnish\r",
            "3 teaspoon fresh thyme, finely chopped\r",
            "1\/2 cup romano cheese, grated, plus more for finishing\r",
            "Kosher salt and freshly ground black pepper\r",
            "3 tablespoon olive oil\r",
            "3 clove garlic, smashed\r",
            "1 1\/2 pound assorted mushrooms (shiitake, portobello, cremini), coarsely chopped\r",
            "2 shallots, finely diced\r",
            "1 ounce dried porcini mushrooms, soaked in boiling water for 30 minutes\r",
            "16 lasagna noodles, cooked for 5 minutes in boiling salted water, drained and rinsed with cold water\r",
            "1 1\/4 pound fontina cheese, coarsely grated"
        ],
        "tags": [
            "vegetarian",
            "main",
            "untried"
        ]
    },
    {
        "id": 18,
        "name": "Eggs with mushrooms and tomatoes",
        "source": "http:\/\/www.realsimple.com\/food-recipes\/browse-all-recipes\/poached-eggs-mushrooms-tomatoes",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 720,
        "servings": 4,
        "comments": "",
        "calories": 1576,
        "fat": 72,
        "satfat": 16,
        "carbs": 152,
        "fiber": 28,
        "sugar": 40,
        "protein": 100,
        "instructions": "Toast the bread.\r\n\r\nThen, do the following two things simultaneously:\r\n\r\n* Fry the eggs. As each pair of eggs is fried, put them on top of the bread.\r\n\r\n* Heat the oil in a large nonstick skillet over medium-high heat. Add the tomatoes, mushroom, and thyme, season with salt and pepper, and cook until tender, 5-7 minutes. Distribute this on top of the eggs (and around the plate, as there will be too much to stack).\r\n\r\nFinally, sprinkle with parmesan and chives.",
        "ingredients": [
            "4 slices country bread, toasted\r",
            "<hr>\r",
            "1 teaspoon olive oil\r",
            "1 cup grape tomatoes, halved\r",
            "1\/2 tsp kosher salt \r",
            "1\/2 tsp black pepper\r",
            "1 pound mushrooms, sliced\r",
            "1 tablespoon fresh thyme\r",
            "<hr>\r",
            "8 large eggs\r",
            "1 ounce Parmesan, shaved\r",
            "2 tablespoon chopped fresh chives"
        ],
        "tags": [
            "breakfast",
            "vegetarian"
        ]
    },
    {
        "id": 19,
        "name": "Mushroom & Broccoli Casserole with Baked Pastry",
        "source": "Blue Apron",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 2700,
        "servings": 2,
        "comments": "",
        "calories": 1280,
        "fat": 72,
        "satfat": 34,
        "carbs": 138,
        "fiber": 22,
        "sugar": 22,
        "protein": 34,
        "instructions": "Preheat the oven to 400°F. Wash and dry the fresh produce. In a bowl, combine the dried porcini mushrooms and 1 1\/2 cups of hot water; let stand for at least 10 minutes, then remove (reserving the water) and roughly chop.\r\n\r\nToss broccoli florets with olive oil, salt, and pepper, and roast in the oven for 12-14 minutes, until lightly browned and tender. Remove from the oven, leaving it on.\r\n\r\nWhile the broccoli roasts, in a large pot, heat 2 teaspoons of olive oil on medium-high until hot. Add the carrots, celery, oyster mushrooms, chopped porcini mushrooms, thyme, and scallion whites. Season with salt and pepper. Cook, stirring occasionally, 12 to 14 minutes, or until softened.\r\n\r\nAdd the butter to the pan and cook, stirring frequently, 30 seconds to 1 minute, or until melted. Add the flour and cook, stirring frequently, 30 seconds to 1 minute, or until lightly browned. Slowly stir in the reserved mushroom water. Cook, stirring occasionally, 2 to 4 minutes, or until the mixture is slightly thickened. Add the roasted broccoli and stir to combine. Turn off the heat and season with salt and pepper to taste.\r\n\r\nTransfer the finished filling to a baking dish. Top with pie crust. Bake as directed by pie crust instructions (probably 12 minutes), until crust is golden brown. When five minutes remain, top with shredded cheese and return to oven. Let stand for at least 2 minutes before serving. Top with scallion greens.",
        "ingredients": [
            "1\/2 oz dried porcini mushrooms\r",
            "1\/2 lb broccoli, cut into florets, stem diced\r",
            "6 oz oyster mushrooms, roughly chopped\r",
            "2 carrots, small diced\r",
            "2 green onions, small diced and separated\r",
            "1 stalk celery, small diced\r",
            "1 tsp fresh thyme\r",
            "3 tbsp flour\r",
            "2 tbsp butter\r",
            "1 oz cheddar cheese, shredded\r",
            "1 pie crust"
        ],
        "tags": [
            "vegetarian",
            "main"
        ]
    },
    {
        "id": 20,
        "name": "Chirashi-Style Rice Bowls",
        "source": "https:\/\/www.blueapron.com\/recipes\/chirashi-style-rice-bowls-with-tempura-mushrooms-spicy-pickled-carrots",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 1800,
        "servings": 2,
        "comments": "Make sure the batter is watery",
        "calories": 1340,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 450°. Place **diced avocado** in a bowl with **vinegar** and salt.\r\n\r\nIn a small pot, combine the **rice**, a **big pinch of salt**, and **1 ½ cups of water**. Heat to boiling on high. Once boiling, cover and reduce the heat to low. Cook 15 to 17 minutes, or until the water has been absorbed and the rice is tender. Turn off the heat and fluff the cooked rice with a fork.\r\n\r\nWhile the rice cooks, place the **broccoli** on a sheet pan. Drizzle with olive oil and season with salt and pepper. Toss to thoroughly coat. Arrange in a single, even layer. Roast 14 to 16 minutes, or until browned and tender when pierced with a fork. Remove from the oven. Transfer to a large bowl. Set aside in a warm place.\r\n\r\nWhile the broccoli roasts, in a medium pan (nonstick, if you have one), combine the **carrots**, **sugar**, **remaining vinegar**, a **big pinch of salt**, and **¼ cup of water**. Heat to boiling on high. Once boiling, cook, stirring occasionally, 30 seconds to 1 minute, or until the sugar has dissolved. Turn off the heat. Stir in **as much of the gochujang** as you'd like, depending on how spicy you'd like the dish to be. Transfer to a bowl. Set aside to cool, stirring occasionally, for at least 10 minutes. Rinse and wipe out the pan.\r\n\r\nWhile the carrots cool, in a large bowl, combine the **tempura mix** and **¼ cup of cold water**; whisk until smooth. Season with salt and pepper. In the same pan, heat a thin layer of oil on medium-high until hot. Once the oil is hot enough that a drop of batter sizzles immediately when added to the pan, working in batches, thoroughly coat the **mushrooms** in the batter (letting any excess drip off) and carefully add to the pan. Cook 2 to 4 minutes per side, or until golden brown. Transfer to a paper towel-lined plate; immediately season with salt.\r\n\r\nTo the bowl of **roasted broccoli**, add the **mirin** and **soy sauce**. Toss to thoroughly coat; season with salt and pepper to taste. Divide the **cooked rice** and dressed broccoli between 2 bowls. Top with the **pickled carrots** (reserving the pickling liquid), **seasoned avocado**, and **tempura mushrooms**. Drizzle with the **reserved pickling liquid**. Garnish the rice with the **furikake**.",
        "ingredients": [
            "3\/4 cup Sushi Rice\r",
            "6 oz Shiitake Mushrooms, stems removed\r",
            "1 Avocado, medium diced\r",
            "1\/2 lb Broccoli, cut into bite-size florets\r",
            "1\/2 tbsp rice vinegar\r",
            "<hr>\r",
            "2 Rainbow Carrots, thinly sliced at an angle\r",
            "1 1\/2 Tbsp Rice Vinegar\r",
            "1 1\/2 Tbsp Sugar\r",
            "1 Tbsp Gochujang\r",
            "<hr>\r",
            "1 Tbsp Mirin\r",
            "1 Tbsp Soy Sauce\r",
            "1 tsp Furikake\r",
            "1\/4 cup Tempura Mix"
        ],
        "tags": [
            "main",
            "vegetarian"
        ]
    },
    {
        "id": 21,
        "name": "Sweet & Savory Korean Rice Cakes",
        "source": "https:\/\/www.blueapron.com\/recipes\/sweet-savory-korean-rice-cakes-with-plum-yu-choy-garlic-chives",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 1580,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Soft cook the **eggs**. (Bring ½\" water to boil, add eggs, turn down to medium, cover, cook for 6½ minutes. Immediately remove and cool in ice bath.)\r\n\r\nWhile the **eggs** cook, in a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium-high until hot. Add the **mushrooms**; cook, stirring occasionally, 3 to 4 minutes, or until lightly browned. Add the **yu choy**; season with salt and pepper. Cook, stirring occasionally, 2 to 3 minutes, or until wilted. Add the **endive**; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until softened. Transfer to a bowl; season with salt and pepper to taste.\r\n\r\nIn the same pan, heat 1 teaspoon of olive oil on medium-high until hot. Add the **ginger**, **seasoned plum**, and as much of the **jalapeño** as you’d like, depending on how spicy you’d like the dish to be; season with salt and pepper. Cook, stirring occasionally, 1 to 2 minutes, or until softened. Add **¾ cup of water**; season with salt and pepper. Cook, stirring occasionally and gently smashing the plum with a spoon, 8 to 9 minutes, or until the plum has broken down. Add the **black bean sauce** and **2 tablespoons of water**. Cook, stirring frequently, 1 to 2 minutes, or until combined. Turn off the heat. Season with salt and pepper to taste.\r\n\r\nOnce the sauce has cooked for about 10 minutes, add the **rice cakes** to the pot of boiling water. Cook 2 to 3 minutes, or until tender. Reserving **½ cup of the rice cake cooking water**, drain thoroughly. Transfer to the pan of **sauce**; add the **cooked vegetables**, **crème fraîche**, **butter**, **half the garlic chives**, and **half the reserved rice cake cooking water**. Cook on medium-high, stirring frequently, 1 to 2 minutes, or until coated and thoroughly combined. (If the sauce seems dry, gradually add the remaining rice cake cooking water to achieve your desired consistency.) Turn off the heat; season with salt and pepper to taste.\r\n\r\nTransfer the **peeled eggs** to a cutting board and halve lengthwise; season with salt and pepper. Divide the **finished rice cakes** between 2 dishes. Top with the seasoned eggs. Garnish with the **peanuts** and **remaining garlic chives**. ",
        "ingredients": [
            "1\/2 lb Korean Rice Cakes\r",
            "2 Cage-Free Farm Eggs\r",
            "4 oz Shiitake Mushrooms, stems removed, thinly sliced\r",
            "1 bunch Yu Choy, base removed, roughly chopped\r",
            "1 Jalapeño Pepper, remove seeds, thinly slice\r",
            "1 Plum, medium diced and seasoned with salt\r",
            "1 White Endive, base removed, thinly sliced\r",
            "1\/2 bunch Garlic Chives\r",
            "3 Tbsps  Roasted Peanuts\r",
            "2 Tbsps  Black Bean Sauce\r",
            "2 Tbsps  Butter\r",
            "2 Tbsps  Crème Fraîche\r",
            "1 1-Inch Piece Ginger, finely chopped"
        ],
        "tags": [
            "main",
            "vegetarian"
        ]
    },
    {
        "id": 22,
        "name": "Cheesy mushroom omelette",
        "source": "https:\/\/www.bbcgoodfood.com\/recipes\/1744\/cheesy-mushroom-omelette",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 600,
        "servings": 1,
        "comments": "",
        "calories": 332,
        "fat": 26,
        "satfat": 10,
        "carbs": 4,
        "fiber": 1,
        "sugar": 2,
        "protein": 21,
        "instructions": "Heat the olive oil in a small non-stick frying pan. Tip in the mushrooms and fry over a high heat, stirring occasionally for 2-3 mins until golden. Lift out of the pan into a bowl and mix with the cheese and parsley.\r\n\r\nPlace the pan back on the heat and swirl the eggs into it. Cook for 1 min or until set to your liking, swirling with a fork now and again.\r\n\r\nSpoon the mushroom mix over one half of the omelette. Using a spatula or palette knife, flip the omelette over to cover the mushrooms. Cook for a few moments more, lift onto a plate and serve.",
        "ingredients": [
            "1\/2 tbsp olive oil\r",
            "3 cremini mushrooms (3 ≈ 2oz), sliced\r",
            "1 oz cheddar cheese, grated\r",
            "1 tbsp fresh parsley, chopped\r",
            "2 eggs, beaten"
        ],
        "tags": [
            "vegetarian",
            "breakfast"
        ]
    },
    {
        "id": 23,
        "name": "Pesto Cavatelli w\/ Mushrooms and Spicy Breadcrumbs",
        "source": "https:\/\/www.blueapron.com\/recipes\/creamy-pesto-cavatelli-with-mushrooms-spicy-breadcrumbs",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 1800,
        "servings": 2,
        "comments": "",
        "calories": 1740,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Heat a medium pot of salted water to boiling on high.\r\n\r\nIn a medium pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the **breadcrumbs** and half the **chopped garlic**; season with salt and pepper. Cook, stirring frequently, 2 to 3 minutes, or until golden brown. Turn off the heat and add the red pepper flakes, salt, and pepper. Transfer to a plate. Wipe out the pan. \r\n\r\nWhile the breadcrumbs toast, add the **pasta** to the pot of boiling water. Cook, stirring occasionally, 9 to 11 minutes, or until al dente (still slightly firm to the bite). Turn off the heat. Reserving ½ cup of the pasta cooking water, drain thoroughly and return to the pot. \r\n\r\nWhile the pasta cooks, in the same pan, heat 2 teaspoons of olive oil on medium-high until hot. Add the **sliced mushrooms** in an even layer and cook, without stirring, 3 to 4 minutes, or until lightly browned. Continue to cook, stirring occasionally, 1 to 2 minutes, or until browned. Add the **sliced zucchini** and remaining **chopped garlic**; season with salt and pepper. Cook, stirring frequently, 4 to 5 minutes, or until lightly browned. Turn off the heat and season with salt and pepper to taste. \r\n\r\nTo the pot of **cooked pasta**, add the **cooked vegetables**, **mascarpone cheese**, and half the reserved pasta cooking water. Cook on medium-high, stirring vigorously, 1 to 2 minutes, or until coated. If the pasta seems dry, gradually add the remaining pasta cooking water to achieve your desired consistency. Turn off the heat. Stir in the **pesto** and **chopped peppers** until thoroughly combined. Season with salt and pepper to taste. Serve the finished pasta garnished with the spicy breadcrumbs.",
        "ingredients": [
            "6 oz cavatelli pasta\r",
            "2 clove garlic, finely chopped\r",
            "4 oz cremini Mushrooms, thinly sliced\r",
            "1\/3 cup Basil & Cashew Pesto\r",
            "1\/4 tsp Crushed Red Pepper Flakes\r",
            "1\/4 cup Panko\r",
            "1 Tbsp  mascarpone cheese\r",
            "1 oz Roasted Piquillo Peppers, diced\r",
            "1 Zucchini, halved and thinly sliced"
        ],
        "tags": [
            "vegetarian",
            "pasta",
            "main"
        ]
    },
    {
        "id": 24,
        "name": "Banh Mi Sandwiches with Roasted Broccoli",
        "source": "Blue Apron",
        "preptime": 600,
        "waittime": 1800,
        "cooktime": 0,
        "servings": 2,
        "comments": "Pair with a zesty, tropical white wine",
        "calories": 1540,
        "fat": 82,
        "satfat": 8,
        "carbs": 174,
        "fiber": 16,
        "sugar": 36,
        "protein": 36,
        "instructions": "Place an oven rack in the center of the oven, then preheat to 450°F. Line a sheet pan with aluminum foil. Place **broccoli** on the sheet pan. Drizzle with olive oil and season with salt and pepper; toss to coat. Arrange in an even layer. Roast 19 to 21 minutes, or until lightly browned and tender when pierced with a fork. Leaving the oven on, transfer the roasted broccoli to a bowl. Reserving the sheet pan, remove and discard the foil.\r\n\r\nTo make the spicy mayonnaise, in a bowl, combine the **mayonnaise** and as much of the **sambal oelek** as you’d like, depending on how spicy you’d like the dish to be. Season with salt and pepper to taste. In a medium bowl, combine the sliced **radishes**, **grated carrots**, **sugar**, and **vinegar**; season with salt and pepper. Set aside to marinate, stirring occasionally, for at least 10 minutes. Season with salt and pepper to taste.\r\n\r\nWhile the vegetables marinate, in a medium pan (nonstick, if you have one), heat 2 tablespoons of olive oil on medium-high until hot. Add the quartered **mushrooms** in an even layer. Cook, without stirring, 2 to 3 minutes, or until lightly browned and slightly softened; season with salt and pepper. Continue to cook, stirring occasionally, 2 to 3 minutes, or until softened. Add the chopped **ginger**; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until softened. Turn off the heat and season with salt and pepper to taste.\r\n\r\nPlace the halved **baguettes** cut side up on the sheet pan used to roast the broccoli. Drizzle with olive oil and season with salt and pepper. Toast in the oven 5 to 7 minutes, or until the edges are lightly browned. Carefully transfer to a work surface.\r\n\r\nWhile the baguettes toast, reserving the liquid, drain the marinated vegetables. Set aside. Add the reserved marinating liquid and **sesame seeds** to the bowl of roasted broccoli; stir to coat. Season with salt and pepper to taste.\r\n\r\nBuild the sandwiches using the toasted baguettes, spicy mayonnaise, cooked mushrooms, and marinated vegetables. Serve the sandwiches with the dressed broccoli. Enjoy!",
        "ingredients": [
            "1\/2 lb Broccoli, cut into small florets\r",
            "1\/2 lb Cremini Mushrooms, quartered\r",
            "1 1-Inch Piece Ginger, peeled and finely chopped\r",
            "<hr>\r",
            "1\/4 cup Mayonnaise\r",
            "1 Tbsp Sambal Oelek\r",
            "<hr>\r",
            "3 oz Radishes, thinly sliced into half-moons\r",
            "6 oz Carrots, grated\r",
            "1 Tbsp Sugar\r",
            "2 Tbsp Rice Vinegar\r",
            "<hr>\r",
            "2 Small Baguettes, halved\r",
            "1\/2 tsp Black sesame seeds\r",
            "1\/2 tsp White Sesame Seeds\r",
            "Olive oil\r",
            "Salt\r",
            "Black pepper"
        ],
        "tags": [
            "vegetarian",
            "main",
            "sandwiches"
        ]
    },
    {
        "id": 25,
        "name": "Mushroom Barley Soup",
        "source": "https:\/\/twitter.com\/arh279\/status\/1199061800295305223",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 3600,
        "servings": 15,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Clean **barley** and put to boil in a large pot of salted water. (If using pearled, boil for 30min; if using hulled, boil for ~1hr.)\r\n2. Soak **porcini mushrooms** in a bowl of very hot water, just enough to cover them.\r\n3. Saute the **onion** with some salt. When they're translucent (~5min), add the **garlic**, **cremini mushrooms**, and more salt, and cook until the mushroom's water is boiled out (~12min).\r\n4. Remove now-rehydrated mushrooms from the water (reserving the water!) and rough chop. Add to the onion\/mushroom mixture, along with a tsp of truffle oil. Cook for 5min.\r\n5. When barley is done (do not drain!), add the onion\/mushroom mixture, the **potatoes**, the **reserved mushroom water**, some more truffle oil, and a heavy pinch of salt. Cook for ~15min, until potatoes are tender.\r\n6. Serve with dollop of sour cream and a few drops of truffle oil.",
        "ingredients": [
            "2 cup barley (preferably pearled)\r",
            "1 large onion, diced\r",
            "4 clove garlic, rough chopped\r",
            "2 large potatoes, medium diced\r",
            "2 lb cremini mushrooms, diced\r",
            "4 oz dried porcini mushrooms\r",
            "truffle oil\r",
            "sour cream (for serving)"
        ],
        "tags": [
            "vegetarian",
            "soup",
            "main",
            "untried"
        ]
    },
    {
        "id": 26,
        "name": "Tofu soboro (iridofu)",
        "source": "The Just Bento Cookbook by Makiko Itoh",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Ensure the tofu has been drained and pressed.\r\n\r\nTo a small bowl, add shiitake mushrooms and enough hot water to completely cover them. Allow to sit for at least 10 minutes or until softened. Remove from the water, reserving the soaking liquid. Squeeze out excess moisture from the shiitake, discard the stems, and chop the caps finely.\r\n\r\nIn a small bowl, combine the miso, soy sauce, and enough of the shiitake soaking liquid to make a smooth paste.\r\n\r\nIn a large frying pan, briefly saute the chopped shiitake, green onion, and ginger in the sesame oil over high heat. Lower the heat to medium. Add the tofu to the pan, crumbling it with your hands. Add the salt. Keep stirring the tofu, using two pairs of cooking chopsticks held together (or just keep breaking apart with wooden spoon), until it starts to resemble fine, rather dry scrambled eggs.\r\n\r\nAdd the miso sauce to the pan and continue stirring until the liquid is completely absorbed and the pan is dry. Season with black pepper to taste.\r\n\r\nLet cool completely before packing or using. This dish is best made the night before. It can be stored in the refrigerator for up to a week. It does get a little tough if it's been frozen, though it's still pretty good.",
        "ingredients": [
            "4 dried shiitake mushrooms\r",
            "1 lb firm tofu, drained and pressed\r",
            "2 Tbsp mild white miso\r",
            "1 Tbsp soy sauce\r",
            "4 Tbsp reserved shiitake soaking liquid\r",
            "1 1\/2 cup green onion, finely chopped\r",
            "1 tsp ginger, peeled and finely chopped\r",
            "2 Tbsp sesame oil\r",
            "1\/3 tsp salt\r",
            "black pepper, to taste"
        ],
        "tags": [
            "vegetarian",
            "bento"
        ]
    },
    {
        "id": 27,
        "name": "Cajun Catfish and Spiced Rice",
        "source": "https:\/\/www.blueapron.com\/recipes\/cajun-catfish-dirty-rice-with-collard-greens-mushrooms",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 2400,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a small pot, heat 2 tsp oil on medium. Add the **white bottoms of the scallions**, **peppers**, **half the garlic**, **spice blend**. Season with salt and pepper. Cook 30s-1m, until fragrant. Add the **tomato paste** and cook 1-2 minutes. Add the **rice**, salt, and 1 cup of water; heat to boiling on high, then cover and reduce to low, cooking for 18 minutes or until all the water has been absorbed. Fluff with a fork; season to taste.\r\n\r\nWhile the rice cooks, in a large pan, add the **collard greens** and **remaining garlic**. Season, and cook 2-3 minutes, stirring frequently, until slightly wilted. Add 1\/2 cup of water and cook 3-5 minutes, until wilted and the water has cooked off. Add **half the vinegar**, cook 30s-1min, then remove from the pan and keep warm.\r\n\r\nIn the same pan, add the **mushrooms** and cook 3-4 minutes until browned. Add **butter**, salt, and pepper, cook for 30s, until melted. Add the **remaining vinegar** and **half the green scallion tops**; cook another 30s until combined. Remove from the pan and keep warm.\r\n\r\nSeason the **catfish** with salt and pepper on both sides. Cook 4-6 minutes on first side, until browned, then flip and cook 2-4 minutes, until lightly browned and cooked thru.\r\n\r\nDivide rice, greens, and catfish between dishes; top catfish with mushrooms and **remaining scallion greens**.",
        "ingredients": [
            "1 tbsp cajun spice blend (smoked paprika, ground yellow mustard, onion powder, garlic powder, dried ground oregano, dried thyme & cayenne pepper)\r",
            "3 clove garlic, minced and divided\r",
            "2 scallions, thinly sliced with whites and greens divided\r",
            "1 oz sweet piquante peppers, thinly sliced\r",
            "2 tbsp tomato paste\r",
            "1\/2 cup long grain white rice\r",
            "<hr>",
            "1 bunch collard greens\r",
            "1 tbsp apple cider vinegar, divided\r",
            "4 oz cremini mushrooms, thinly sliced\r",
            "2 tbsp butter\r",
            "2 catfish fillets"
        ],
        "tags": [
            "main",
            "fish"
        ]
    },
    {
        "id": 28,
        "name": "Scallops over Truffled Mushroom Risotto",
        "source": "Hello Fresh",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 3000,
        "servings": 2,
        "comments": "Rachel added white wine to the recipe and moved the mushroom to cook in the risotto rather than separately",
        "calories": 1520,
        "fat": 84,
        "satfat": 34,
        "carbs": 154,
        "fiber": 10,
        "sugar": 14,
        "protein": 28,
        "instructions": "Bring stock to a boil in a medium pot. Once boiling, reduce to a low simmer. Meanwhile, prep remaining ingredients.\r\n\r\nHeat a drizzle of oil in a large pan over medium-high heat. Add mushrooms and season with salt and pepper. Cook, stirring occasionally, until browned and crisp, 6-8 minutes. Add garlic and shallot. Cook, stirring, until softened, 1 minute. Add rice; stir until translucent, 1-2 minutes. Add wine; stir until liquid has mostly absorbed. Add stock 1\/2 cup at a time and stirring until liquid has mostly absorbed—until rice is al dente and mixture is creamy, 25-30 minutes. TIP: Depending on the size of your pan, you may need a little more or a little less liquid.\r\n\r\nAfter about half of stock is used in risotto, pat scallops* dry with paper towels and season generously all over with salt and pepper. Heat a drizzle of oil in a large pan over medium-high heat. Add scallops and cook until browned and cooked through, 3-5 minutes per side. Turn off heat; remove from pan and set aside, covered. Wipe out pan.\r\n\r\nMelt 2 tbsp butter in same pan over medium heat. Cook, stirring, until foamy and flecked with amber brown bits, 2-4 minutes. Stir in half the chopped parsley and a squeeze of lemon juice. Immediately transfer to a small bowl. Once risotto is done, stir in Parmesan, 1 tbsp plain butter, a squeeze of lemon juice, and lemon zest and truffle oil to taste.\r\n\r\nSeason risotto with salt, pepper, and more lemon juice to taste. • Divide between bowls; top with scallops. Drizzle with as much brown butter as you like and any remaining truffle oil to taste. Garnish with remaining chopped parsley. Serve with any remaining lemon wedges on the side.\r\n\r\n",
        "ingredients": [
            "3 1\/2 cup chicken stock\r",
            "1 clove garlic, peeled and thinly sliced\r",
            "1 shallot, minced\r",
            "3\/4 cup arborio rice\r",
            "1\/4 cup dry white wine\r",
            "8 oz cremini mushrooms, sliced into 1\/4-inch thick pieces\r",
            "1 lemon, zested and juiced\r",
            "1\/4 oz fresh parsley, chopped\r",
            "8 oz scallops, tough muscle removed if needed\r",
            "2 tbsp butter\r",
            "<hr>\r",
            "1\/4 cup parmesan cheese, grated\r",
            "1 tbsp butter\r",
            "5 tsp truffle oil\r",
            "vegetable oil\r",
            "salt\r",
            "pepper"
        ],
        "tags": [
            "seafood",
            "untried"
        ]
    },
    {
        "id": 29,
        "name": "Spicy poblano and mushroom quesadillas",
        "source": "Blue Apron",
        "preptime": 1500,
        "waittime": 0,
        "cooktime": 900,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Combine diced **avocado** and juice from **1\/4 lime** in a bowl, season with salt and pepper.\r\n\r\nIn a large pan, heat 1 tbsp olive oil on medium-high until hot. Add **mushrooms** and **pepper**, season with salt and pepper. Cook, stirring occasionally, 5 to 6 minutes, or until lightly browned and slightly softened.\r\n\r\nAdd **water** and as much of the **chile paste** as you'd like. Season with salt and pepper. Cook, stirring constantly, 30 seconds to a minute, or until thickened and most of the water has cooked off.\r\n\r\nTurn off heat and stir in **1\/2 tbsp cilantro** and juice from **1\/4 lime**.\r\n\r\nPlace the **tortillas** on a work surface. Divide **half the cheddar cheese** between 2 of the tortillas; top with the cooked vegetables and **remaining cheddar**. Complete the quesadillas with the remaining tortillas. Rinse and wipe out the pan.\r\n\r\nIn the same pan, heat 1 tbsp olive oil on medium until hot. Working 1 at a time, add the quesadillas and cook 2-3 minutes per side, or until the tortillas are browned and the cheese has melted. Transfer to a work surface. Immediately season with salt.\r\n\r\nWhile the quesadillas cook, in a medium bowl, combine the lettuce, radishes, **juice of 1\/2 lime**, and a drizzle of olive oil. Season with salt and pepper. Toss to combine.\r\n\r\nTo serve, cut the quesadillas into quarters. Divide the salad and quesadillas between 2 dishes. Top the salad with the **seasoned avocado** and **Cotija cheese**. Garnish the quesadillas with the remaining **cilantro**. Enjoy!",
        "ingredients": [
            "1 avocado, pitted, peeled and large diced\r",
            "1\/4 lime, juiced\r",
            "<hr>\r",
            "4 oz cremini mushrooms, thinly sliced\r",
            "1 poblano pepper, thinly sliced lengthwise\r",
            "1\/4 cup water\r",
            "1 tbsp chipotle chile paste, or to taste\r",
            "1\/2 tbsp cilantro, roughly chopped\r",
            "1\/4 lime, juiced\r",
            "<hr>\r",
            "4 small flour tortillas\r",
            "4 oz cheddar cheese, grated\r",
            "<hr>\r",
            "1 romaine lettuce heart, cut into bite sized pieces\r",
            "3 radishes, sliced into rounds\r",
            "1\/2 lime, juiced\r",
            "2 tbsp Cotija cheese, grated\r",
            "1\/2 tbsp cilantro, roughly chopped"
        ],
        "tags": [
            "vegetarian",
            "main"
        ]
    },
    {
        "id": 30,
        "name": "Cheesy portobello mushroom caps",
        "source": "Hello Fresh",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 1800,
        "servings": 2,
        "comments": "",
        "calories": 1139,
        "fat": 51,
        "satfat": 18,
        "carbs": 126,
        "fiber": 9,
        "sugar": 23,
        "protein": 40,
        "instructions": "Preheat oven to 425F. Bring a large pot of salted water to a boil.\r\n\r\nToss **zucchini** with olive oil, half the **italian seasoning**, salt and pepper, and place on half a baking sheet. Brush both sides of each **portobello mushroom** with olive oil, and season all over with salt, pepper, and remaining **italian seasoning**. Arrange mushrooms gill sides down on empty side of same baking sheet. Roast on top rack until tender, 14-16 minutes.\r\n\r\nMeanwhile, prepare marinara sauce.\r\n\r\nOnce water is boiling, add **spaghetti** to pot. Cook until al dente, 9-11 minutes (or according to package directions). Reserve **1\/2 cup pasta cooking water**, then drain and return to pot.\r\n\r\nMeanwhile, melt butter in a small pan over medium-high heat. Add **panko**, and lightly season. Cook stirring frequently, until golden brown, 3-5 minutes. Remove from heat.\r\n\r\nAdd zucchini and most of the marinara, reserving 1\/8 cup per serving, to spaghetti. Stir well, adding pasta water as necessary, until pasta is coated.\r\n\r\nHeat broiler to high. Flip portobello mushrooms over on baking sheet to expose gills. Top with reserved marinara, then mozzarella, and broil 2-4 minutes, until cheese is lightly browned. \r\n\r\nDivide spaghetti between plates and top with cheesy mushrooms. Sprinkle with toasted breadcrumbs and serve.",
        "ingredients": [
            "1 zucchini, cut crosswise into 1\/2-inch-thick half-moons\r",
            "2 portobello mushrooms, stems and gills removed\r",
            "1 tsp Italian seasoning\r",
            "2 tbsp olive oil\r",
            "salt & pepper\r",
            "<hr>\r",
            "4 oz dried spaghetti\r",
            "1\/2 tbsp butter\r",
            "1\/4 cup panko\r",
            "4 serving marinara sauce",
            "2 oz mozzarella cheese, shredded"
        ],
        "tags": [
            "vegetarian",
            "main",
            "low_tyramine",
            "pasta"
        ]
    },
    {
        "id": 31,
        "name": "Vegetarian Jjajangmyeon",
        "source": "https:\/\/www.maangchi.com\/recipe\/jjajangmyeon",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 1200,
        "servings": 2,
        "comments": "Adapted to use mushroom instead of pork",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Cook noodles according to package directions. Drain and rinse under cold water. Set aside.\r\n\r\nHeat 1 Tablespoon of vegetable oil over medium high heat in a wok or large skillet. Add mushrooms and radish and stir fry for 1 minute.\r\n\r\nAdd potato, onion, and zucchini and keep stirring for about 3 minutes until the potato looks a little translucent.\r\n\r\nClear a space in the center of the wok by pushing the ingredients to the edges.\r\n\r\nAdd 2 Tablespoons of vegetable oil to the center of the wok, then add 1\/4 cup of black bean paste and stir it with a wooden spoon for 1 minute to fry it. Then mix everything in the wok and keep stirring.\r\n\r\nAdd  2 cups of water to the wok and let it cook with the lid closed for about 10 minutes.\r\n\r\nOpen the lid and taste a sample of the radish and potato. If they’re fully cooked, stir in the starch water little by little. Keep stirring until it’s well mixed and thick.\r\n\r\nAdd the sesame oil and remove from the heat.\r\n\r\nServe over noodles, garnish with cucumber.",
        "ingredients": [
            "6 oz fresh udon noodles (or 4 oz dried udon or spaghetti noodles)\r",
            "1 tablespoon vegetable oil\r",
            "8 oz shiitake mushrooms\r",
            "1 cup daikon radish, cut into ½ inch cubes\r",
            "1 cup zucchini, cut into ½ inch cubes\r",
            "1 cup potato, peeled and cut into ½ inch cubes\r",
            "1 1\/2 cup onion, large diced\r",
            "2 tablespoon vegetable oil\r",
            "1\/4 cup black bean paste\r",
            "2 cup water\r",
            "2 tablespoon potato starch powder, combined with ¼ cup water and 1 teaspoon of sugar in a small bowl, set aside\r",
            "1 teaspoon toasted sesame oil\r",
            "1\/2 cup cucumber, cut into thin matchsticks for garnish"
        ],
        "tags": [
            "vegetarian",
            "main",
            "korean",
            "untried"
        ]
    } ,
    {
        "id": 32,
        "name": "Vegetarian Chili",
        "source": "Emeril Lagasse",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 8,
        "comments": "Nutrition information is without any toppings",
        "calories": 1560,
        "fat": 40,
        "satfat": 0,
        "carbs": 248,
        "fiber": 80,
        "sugar": 56,
        "protein": 72,
        "instructions": "In a large (6qt), heavy pot, heat the oil over medium-high heat. Add the onions, bell peppers, garlic, and serrano peppers, and cook, stirring, until soft, about 3 minutes. \r\n\r\nAdd the zucchini and mushrooms, and cook, stirring, until soft and the vegetables give off their liquid and start to brown around the edges, about 6 minutes. Add the chili powder, cumin, salt and cayenne, and cook, stirring, until fragrant, about 30 seconds. \r\n\r\nAdd the tomatoes and stir well. Add the beans, tomato sauce, and vegetable stock, stir well, and bring to a boil. Reduce the heat to medium-low and simmer, stirring occasionally, for about 20 minutes.\r\n\r\nRemove from the heat and stir in the cilantro and lime juice. Adjust the seasoning, to taste.\r\n\r\nTo serve, place 1\/4 cup of brown rice in the bottom of each bowl. Ladle the chili into the bowls over the rice. Top each serving with a dollop of sour cream and spoonful of avocado or guacamole. Sprinkle with Essence and green onions and serve.",
        "ingredients": [
            "2 tablespoon canola oil\r",
            "1 1\/2 cup yellow onions, chopped\r",
            "1 cup red bell peppers, chopped\r",
            "2 tablespoon garlic, minced\r",
            "2 serrano peppers, stemmed, seeded, and minced\r",
            "1 medium zucchini, stem ends trimmed and cut into small dice\r",
            "5 large portobello mushrooms, stemmed, wiped clean and cubed\r",
            "2 tablespoon chili powder\r",
            "1 tablespooon ground cumin\r",
            "1 1\/4 teaspoon salt\r",
            "1\/4 teaspoon cayenne\r",
            "4 large tomatoes, peeled, seeded and chopped\r",
            "2 can black beans, rinsed and drained\r",
            "1 15oz can tomato sauce\r",
            "1 cup vegetable stock, or water\r",
            "1 lime, juiced\r",
            "1\/4 cup cilantro, chopped\r",
            "<hr>\r",
            "Cooked brown rice, accompaniment\r",
            "Sour cream or strained plain yogurt, garnish\r",
            "Diced avocado or guacamole, garnish\r",
            "Essence, garnish\r",
            "Chopped green onions, garnish"
        ],
        "tags": [
            "chili",
            "soup",
            "vegetarian",
            "main"
        ]
    }
]